// Підключаємо роутер до бек-енду
const express = require("express");
const router = express.Router();
// ================================================================

// router.get Створює нам один ентпоїнт

// ↙️ тут вводимо шлях (PATH) до сторінки
router.get("/", function (req, res) {
  // res.render генерує нам HTML сторінку

  // ↙️ cюди вводимо назву файлу з сontainer
  res.render("comuniti", {
    // вказуємо назву контейнера
    name: "comuniti",
    // вказуємо назву компонентів
    component: [],

    // вказуємо назву сторінки
    title: "Comuniti",
    // ... сюди можна далі продовжувати додавати потрібні технічні дані, які будуть використовуватися в layout

    // вказуємо дані,
    data: {},
  });
  // ↑↑ сюди вводимо JSON дані
});

// Підключаємо роутер до бек-енду
module.exports = router;
